tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Cross-shell prompt for astronauts
brew "starship"
# CLI tool that moves files or folder to the trash
brew "trash"
# UNIX shell (command interpreter)
brew "zsh"
# Application launcher and productivity software
cask "alfred"
# Two-factor authentication software
cask "authy"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# App to write, plan, collaborate, and get organized
cask "notion"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
vscode "akamud.vscode-theme-onedark"
vscode "eamodio.gitlens"
vscode "github.remotehub"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-repositories"
vscode "pkief.material-icon-theme"
vscode "tamasfe.even-better-toml"
vscode "vscodevim.vim"
